In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [41]:
 df = pd.DataFrame({
     'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
     'population': [17.04, 143.5, 9.5, 45.5],
     'square': [2724902, 17125191, 207600, 603628]
 }, index=['KZ', 'RU', 'BY', 'UA'])
df["density"] = df["population"] / df["square"]
df["density"]

KZ    0.000006
RU    0.000008
BY    0.000046
UA    0.000075
Name: density, dtype: float64

In [45]:
df['population']['KZ']

17.04

In [3]:
ave_data = np.array(np.arange(24)).reshape((6, 4))
dates = pd.date_range('20210101', periods=6)
ave_df = pd.DataFrame(ave_data, index=dates, columns=list('1234'))
ave_df

             1   2   3   4
2021-01-01   0   1   2   3
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15
2021-01-05  16  17  18  19
2021-01-06  20  21  22  23

In [4]:
ave_df['4']

2021-01-01     3
2021-01-02     7
2021-01-03    11
2021-01-04    15
2021-01-05    19
2021-01-06    23
Freq: D, Name: 4, dtype: int64

In [5]:
ave_df[0:3]

            1  2   3   4
2021-01-01  0  1   2   3
2021-01-02  4  5   6   7
2021-01-03  8  9  10  11

In [6]:
ave_df['2021-01-01':'2021-01-03']

            1  2   3   4
2021-01-01  0  1   2   3
2021-01-02  4  5   6   7
2021-01-03  8  9  10  11

In [7]:
ave_df[['1', '3']]

             1   3
2021-01-01   0   2
2021-01-02   4   6
2021-01-03   8  10
2021-01-04  12  14
2021-01-05  16  18
2021-01-06  20  22

In [8]:
ave_df.loc['2021-01-01':'2021-01-03', ['1', '3']]

            1   3
2021-01-01  0   2
2021-01-02  4   6
2021-01-03  8  10

In [9]:
ave_df.loc['2021-01-02', ['1', '3']][0] * 5

20

In [10]:
ave_df.loc[dates[1], '1']

4

In [11]:
ave_data[2]

array([ 8,  9, 10, 11])

In [12]:
ave_df.iloc[2]

1     8
2     9
3    10
4    11
Name: 2021-01-03 00:00:00, dtype: int64

In [13]:
ave_df.iloc[1:3, 0:2]

            1  2
2021-01-02  4  5
2021-01-03  8  9

In [14]:
ave_df.iloc[[1, 2, 3], [0, 2]]

             1   3
2021-01-02   4   6
2021-01-03   8  10
2021-01-04  12  14

In [15]:
ave_df.iloc[1:3, :]

            1  2   3   4
2021-01-02  4  5   6   7
2021-01-03  8  9  10  11

In [16]:
ave_df.iloc[:, 1:3]

             2   3
2021-01-01   1   2
2021-01-02   5   6
2021-01-03   9  10
2021-01-04  13  14
2021-01-05  17  18
2021-01-06  21  22

In [17]:
ave_df[ave_df >= 5]

               1     2     3     4
2021-01-01   NaN   NaN   NaN   NaN
2021-01-02   NaN   5.0   6.0   7.0
2021-01-03   8.0   9.0  10.0  11.0
2021-01-04  12.0  13.0  14.0  15.0
2021-01-05  16.0  17.0  18.0  19.0
2021-01-06  20.0  21.0  22.0  23.0

In [18]:
start_date = '20210101'
ave_numpy_data = np.arange(40).reshape((10, 4))
dates = pd.date_range(start_date, periods=10)
ave_df = pd.DataFrame(ave_numpy_data, index=dates, columns=list('ABCD'))
ave_df

             A   B   C   D
2021-01-01   0   1   2   3
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15
2021-01-05  16  17  18  19
2021-01-06  20  21  22  23
2021-01-07  24  25  26  27
2021-01-08  28  29  30  31
2021-01-09  32  33  34  35
2021-01-10  36  37  38  39

In [42]:
ave_df_cars = ave_df.copy()
ave_df_cars['Cars'] = [
    'ford', 'opel', 'mazda', 'mitsubishi', 'renault', 'lada', 'hummer', 'bmw',
    'mercedes', 'vw'
]
ave_df_cars

             A   B   C   D  extre  extra        Cars
2021-01-01   0   1   2   3      8      8        ford
2021-01-02   4   5   6   7     18     18        opel
2021-01-03   8   9  10  11     28     28       mazda
2021-01-04  12  13  14  15     38     38  mitsubishi
2021-01-05  16  17  18  19     48     48     renault
2021-01-06  20  21  22  23     58     58        lada
2021-01-07  24  25  26  27     68     68      hummer
2021-01-08  28  29  30  31     78     78         bmw
2021-01-09  32  33  34  35     88     88    mercedes
2021-01-10  36  37  38  39     98     98          vw

In [21]:
pd.date_range(start_date, periods=10)

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [23]:
pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          index=pd.date_range(start_date, periods=10))

2021-01-01     1
2021-01-02     2
2021-01-03     3
2021-01-04     4
2021-01-05     5
2021-01-06     6
2021-01-07     7
2021-01-08     8
2021-01-09     9
2021-01-10    10
Freq: D, dtype: int64

In [40]:
ave_series = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
                       index=pd.date_range(start_date, periods=10))
ave_df_cars['extra'] = ave_series * 10 + 2
ave_df

             A   B   C   D  extre  extra
2021-01-01   0   1   2   3      8      8
2021-01-02   4   5   6   7     18     18
2021-01-03   8   9  10  11     28     28
2021-01-04  12  13  14  15     38     38
2021-01-05  16  17  18  19     48     48
2021-01-06  20  21  22  23     58     58
2021-01-07  24  25  26  27     68     68
2021-01-08  28  29  30  31     78     78
2021-01-09  32  33  34  35     88     88
2021-01-10  36  37  38  39     98     98

In [43]:
ave_df_cars.at[dates[4], 'Cars'] = 'Renault'
ave_df_cars

             A   B   C   D  extre  extra        Cars
2021-01-01   0   1   2   3      8      8        ford
2021-01-02   4   5   6   7     18     18        opel
2021-01-03   8   9  10  11     28     28       mazda
2021-01-04  12  13  14  15     38     38  mitsubishi
2021-01-05  16  17  18  19     48     48     Renault
2021-01-06  20  21  22  23     58     58        lada
2021-01-07  24  25  26  27     68     68      hummer
2021-01-08  28  29  30  31     78     78         bmw
2021-01-09  32  33  34  35     88     88    mercedes
2021-01-10  36  37  38  39     98     98          vw

In [35]:
ave_df_cars.iat[3, 2] = 666
ave_df_cars

             A   B    C   D        Cars  extra
2021-01-01   0   1    2   3        ford     12
2021-01-02   4   5    6   7        opel     22
2021-01-03   8   9   10  11       mazda     32
2021-01-04  12  13  666  15  mitsubishi     42
2021-01-05  16  17   18  19     Citroen     52
2021-01-06  20  21   22  23        lada     62
2021-01-07  24  25   26  27      hummer     72
2021-01-08  28  29   30  31         bmw     82
2021-01-09  32  33   34  35    mercedes     92
2021-01-10  36  37   38  39          vw    102

In [36]:
ave_new_array = np.arange(len(ave_df_cars)) * 10 + 5
ave_new_array

array([ 5, 15, 25, 35, 45, 55, 65, 75, 85, 95])

In [44]:
ave_df_cars['E'] = ave_new_array
ave_df_cars

             A   B   C   D  extre  extra        Cars   E
2021-01-01   0   1   2   3      8      8        ford   5
2021-01-02   4   5   6   7     18     18        opel  15
2021-01-03   8   9  10  11     28     28       mazda  25
2021-01-04  12  13  14  15     38     38  mitsubishi  35
2021-01-05  16  17  18  19     48     48     Renault  45
2021-01-06  20  21  22  23     58     58        lada  55
2021-01-07  24  25  26  27     68     68      hummer  65
2021-01-08  28  29  30  31     78     78         bmw  75
2021-01-09  32  33  34  35     88     88    mercedes  85
2021-01-10  36  37  38  39     98     98          vw  95

## missing data

In [48]:
laptops = ['lenovo', 'dell', 'hp', 'chromebook', 'macbook']

laptops_df = pd.DataFrame(
    {
        'price': [350, 400, 500, 560, 1000],
        'disc_space': [0.5, 1, 3, 4, 1.5]
    },
    index=laptops)
laptops_df

            price  disc_space
lenovo        350         0.5
dell          400         1.0
hp            500         3.0
chromebook    560         4.0
macbook      1000         1.5

In [50]:
more_laptops = ['lenovo', 'dell', 'hp', 'huawei', 'macbook']
laptops_df_2 = laptops_df.reindex(more_laptops)
laptops_df_2

          price  disc_space
lenovo    350.0         0.5
dell      400.0         1.0
hp        500.0         3.0
huawei      NaN         NaN
macbook  1000.0         1.5

In [52]:
laptops_df_3 = laptops_df_2.dropna(how='any')
laptops_df_3

          price  disc_space
lenovo    350.0         0.5
dell      400.0         1.0
hp        500.0         3.0
macbook  1000.0         1.5

In [54]:
laptops_df_2.fillna(value=100)

          price  disc_space
lenovo    350.0         0.5
dell      400.0         1.0
hp        500.0         3.0
huawei    100.0       100.0
macbook  1000.0         1.5

In [55]:
pd.isnull(laptops_df_2)

         price  disc_space
lenovo   False       False
dell     False       False
hp       False       False
huawei    True        True
macbook  False       False

In [56]:
laptops_df_2 * 10

           price  disc_space
lenovo    3500.0         5.0
dell      4000.0        10.0
hp        5000.0        30.0
huawei       NaN         NaN
macbook  10000.0        15.0

## stats

In [57]:
pd.set_option('display.precision', 2)
laptops_df_2.describe()

         price  disc_space
count     4.00        4.00
mean    562.50        1.50
std     298.26        1.08
min     350.00        0.50
25%     387.50        0.88
50%     450.00        1.25
75%     625.00        1.88
max    1000.00        3.00

In [59]:
laptops_df_2.mean()

price         562.5
disc_space      1.5
dtype: float64

In [60]:
laptops_df_2.mean(1)

lenovo     175.25
dell       200.50
hp         251.50
huawei        NaN
macbook    500.75
dtype: float64

In [62]:
laptops_df_2

          price  disc_space
lenovo    350.0         0.5
dell      400.0         1.0
hp        500.0         3.0
huawei      NaN         NaN
macbook  1000.0         1.5

In [64]:
laptops_df_2.apply(np.cumsum, axis=0)

          price  disc_space
lenovo    350.0         0.5
dell      750.0         1.5
hp       1250.0         4.5
huawei      NaN         NaN
macbook  2250.0         6.0

In [66]:
pieces = [laptops_df_2[:2], laptops_df_2[2:4], laptops_df_2[3:]]
pieces

[        price  disc_space
 lenovo  350.0         0.5
 dell    400.0         1.0,
         price  disc_space
 hp      500.0         3.0
 huawei    NaN         NaN,
           price  disc_space
 huawei      NaN         NaN
 macbook  1000.0         1.5]

In [68]:
new_list = pieces[0], pieces[2]
pd.concat(new_list)

          price  disc_space
lenovo    350.0         0.5
dell      400.0         1.0
huawei      NaN         NaN
macbook  1000.0         1.5

In [71]:
new_last_row = laptops_df_2.iloc[2]
new_last_row

price         500.0
disc_space      3.0
Name: hp, dtype: float64

In [72]:
laptops_df_2.append(new_last_row)

          price  disc_space
lenovo    350.0         0.5
dell      400.0         1.0
hp        500.0         3.0
huawei      NaN         NaN
macbook  1000.0         1.5
hp        500.0         3.0

## merge

In [73]:
left = pd.DataFrame({
    'my_key': ['k0', 'k1', 'k2', 'k3'],
    'a': ['a0', 'a1', 'a2', 'a3'],
    'b': ['b0', 'b1', 'b2', 'b3']
})
right = pd.DataFrame({
    'my_key': ['k0', 'k1', 'k2', 'k3'],
    'c': ['c0', 'c1', 'c2', 'c3'],
    'd': ['d0', 'd1', 'd2', 'd3']
})

In [77]:
result = pd.merge(left, right, on='my_key')
result

  my_key   a   b   c   d
0     k0  a0  b0  c0  d0
1     k1  a1  b1  c1  d1
2     k2  a2  b2  c2  d2
3     k3  a3  b3  c3  d3

## import data

In [91]:
bank_df = pd.read_csv('~/programProjects/ML/lab1/Pandas/bank.csv')
print(bank_df.head(100))

   age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0   30;"unemployed";"married";"primary";"no";1787;...
1   33;"services";"married";"secondary";"no";4789;...
2   35;"management";"single";"tertiary";"no";1350;...
3   30;"management";"married";"tertiary";"no";1476...
4   59;"blue-collar";"married";"secondary";"no";0;...
..                                                ...
95  41;"unknown";"single";"tertiary";"no";1567;"no...
96  41;"admin.";"married";"tertiary";"no";5426;"ye...
97  30;"admin.";"single";"tertiary";"no";261;"no";...
98  36;"blue-collar";"divorced";"secondary";"no";2...
99  31;"unemployed";"single";"primary";"no";406;"n...

[100 rows x 1 columns]

In [83]:
bank_df.to_csv('~/programProjects/ML/lab1/Pandas/bank_updated.csv')

## grouping

In [92]:
retail_file = '~/programProjects/ML/lab1/Pandas/Online Retail.xlsx'
online_retail_df = pd.read_excel(retail_file,
                                 'Online Retail',
                                 index_col=None,
                                 na_values=['NA'])

In [93]:
online_retail_df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [94]:
online_retail_df.groupby('Quantity').sum()

          UnitPrice  CustomerID
Quantity
-80995         2.08     16446.0
-74215         1.04     12346.0
-9600          0.00         0.0
-9360          0.03     15838.0
-9058          0.00         0.0
...             ...         ...
 4800          0.21     12901.0
 5568          0.00         0.0
 12540         0.00     13256.0
 74215         1.04     12346.0
 80995         2.08     16446.0

[722 rows x 2 columns]

In [98]:
online_retail_df.groupby('Country').count()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID
Country,,,,,,,
Australia,1259,1259,1259,1259,1259,1259,1259
Austria,401,401,401,401,401,401,401
Bahrain,19,19,19,19,19,19,17
Belgium,2069,2069,2069,2069,2069,2069,2069
Brazil,32,32,32,32,32,32,32
Canada,151,151,151,151,151,151,151
Channel Islands,758,758,758,758,758,758,758
Cyprus,622,622,622,622,622,622,622
Czech Republic,30,30,30,30,30,30,30
Denmark,389,389,389,389,389,389,389
EIRE,8196,8196,8196,8196,8196,8196,7485
European Community,61,61,61,61,61,61,61
Finland,695,695,695,695,695,695,695
France,8557,8557,8557,8557,8557,8557,8491
Germany,9495,9495,9495,9495,9495,9495,9495
Greece,146,146,146,146,146,146,146
Hong Kong,288,288,288,288,288,288,0
Iceland,182,182,182,182,182,182,182
Israel,297,297,297,297,297,297,250
Italy,803,803,803,803,803,803,803
Japan,358,358,358,358,358,358,358
Lebanon,45,45,45,45,45,45,45
Lithuania,35,35,35,35,35,35,35
Malta,127,127,127,127,127,127,127
Netherlands,2371,2371,2371,2371,2371,2371,2371
Norway,1086,1086,1086,1086,1086,1086,1086
Poland,341,341,341,341,341,341,341
Portugal,1519,1519,1519,1519,1519,1519,1480
RSA,58,58,58,58,58,58,58
Saudi Arabia,10,10,10,10,10,10,10
Singapore,229,229,229,229,229,229,229
Spain,2533,2533,2533,2533,2533,2533,2533
Sweden,462,462,462,462,462,462,462
Switzerland,2002,2002,2002,2002,2002,2002,1877
USA,291,291,291,291,291,291,291
United Arab Emirates,68,68,68,68,68,68,68
United Kingdom,495478,495478,494024,495478,495478,495478,361878
Unspecified,446,446,446,446,446,446,244

In [99]:
online_retail_df.groupby('Country').sum()

                      Quantity  UnitPrice  CustomerID
Country
Australia                83653   4.05e+03    1.57e+07
Austria                   4827   1.70e+03    5.02e+06
Bahrain                    260   8.66e+01    2.10e+05
Belgium                  23152   7.54e+03    2.57e+07
Brazil                     356   1.43e+02    4.09e+05
Canada                    2763   9.11e+02    2.62e+06
Channel Islands           9479   3.74e+03    1.13e+07
Cyprus                    6317   3.92e+03    7.72e+06
Czech Republic             592   8.82e+01    3.83e+05
Denmark                   8188   1.27e+03    4.88e+06
EIRE                    142637   4.84e+04    1.10e+08
European Community         497   2.94e+02    9.22e+05
Finland                  10666   3.79e+03    8.70e+06
France                  110480   4.30e+04    1.08e+08
Germany                 117448   3.77e+04    1.20e+08
Greece                    1556   7.13e+02    2.01e+06
Hong Kong                 4769   1.22e+04    0.00e+00
Iceland                   2458   4.81e+02    2.25e+06
Israel                    4353   1.08e+03    3.16e+06
Italy                     7999   3.88e+03    1.02e+07
Japan                    25218   8.15e+02    4.57e+06
Lebanon                    386   2.42e+02    5.74e+05
Lithuania                  652   9.94e+01    5.37e+05
Malta                      944   6.66e+02    2.16e+06
Netherlands             200128   6.49e+03    3.42e+07
Norway                   19247   6.53e+03    1.35e+07
Poland                    3653   1.42e+03    4.34e+06
Portugal                 16180   1.30e+04    1.89e+07
RSA                        352   2.48e+02    7.22e+05
Saudi Arabia                75   2.41e+01    1.26e+05
Singapore                 5234   2.51e+04    2.92e+06
Spain                    26824   1.26e+04    3.27e+07
Sweden                   35637   1.81e+03    6.79e+06
Switzerland              30325   6.81e+03    2.38e+07
USA                       1034   6.45e+02    3.67e+06
United Arab Emirates       982   2.30e+02    1.02e+06
United Kingdom         4263829   2.25e+06    5.63e+09
Unspecified               3300   1.20e+03    3.35e+06

## resampling

In [100]:
ave_index = pd.date_range('1/1/2021', periods=10, freq='min')

In [101]:
ave_index

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 00:01:00',
               '2021-01-01 00:02:00', '2021-01-01 00:03:00',
               '2021-01-01 00:04:00', '2021-01-01 00:05:00',
               '2021-01-01 00:06:00', '2021-01-01 00:07:00',
               '2021-01-01 00:08:00', '2021-01-01 00:09:00'],
              dtype='datetime64[ns]', freq='T')

In [103]:
ave_series = pd.Series(np.arange(10), index=ave_index)
ave_series

2021-01-01 00:00:00    0
2021-01-01 00:01:00    1
2021-01-01 00:02:00    2
2021-01-01 00:03:00    3
2021-01-01 00:04:00    4
2021-01-01 00:05:00    5
2021-01-01 00:06:00    6
2021-01-01 00:07:00    7
2021-01-01 00:08:00    8
2021-01-01 00:09:00    9
Freq: T, dtype: int64

In [104]:
ave_series.resample('5min').sum()

2021-01-01 00:00:00    10
2021-01-01 00:05:00    35
Freq: 5T, dtype: int64

In [105]:
ave_series.resample('5min', label='right').sum()

2021-01-01 00:05:00    10
2021-01-01 00:10:00    35
Freq: 5T, dtype: int64

In [106]:
ave_series.resample('5min', label='right', closed='right').sum()

2021-01-01 00:00:00     0
2021-01-01 00:05:00    15
2021-01-01 00:10:00    30
Freq: 5T, dtype: int64

In [107]:
ave_series.resample('30s').asfreq()[0:5]

2021-01-01 00:00:00    0.0
2021-01-01 00:00:30    NaN
2021-01-01 00:01:00    1.0
2021-01-01 00:01:30    NaN
2021-01-01 00:02:00    2.0
Freq: 30S, dtype: float64

In [110]:
def custom_math(array_like):
    temp = np.sum(array_like)
    return temp

In [111]:
ave_series.resample('3min').apply(custom_math)

2021-01-01 00:00:00     3
2021-01-01 00:03:00    12
2021-01-01 00:06:00    21
2021-01-01 00:09:00     9
Freq: 3T, dtype: int64

In [114]:
ave_simple_series = pd.Series(np.random.rand(5), index=list('ABCDE'))
ave_simple_series

A    0.94
B    0.53
C    0.47
D    0.91
E    0.84
dtype: float64

In [117]:
ave_simple_series = pd.Series(np.random.rand(5))
ave_simple_series

0    0.44
1    0.27
2    0.07
3    0.70
4    0.25
dtype: float64

In [118]:
ave_simple_series[:3]

0    0.44
1    0.27
2    0.07
dtype: float64

In [120]:
ave_dictionary = {'A': 30, 'B': -5.8, 'C': 666}
ave_another_series = pd.Series(ave_dictionary)
ave_another_series

A     30.0
B     -5.8
C    666.0
dtype: float64

In [121]:
ave_another_series[2]

666.0

In [122]:
pd.Series(ave_dictionary, index=list('DCBE'))

D      NaN
C    666.0
B     -5.8
E      NaN
dtype: float64

In [123]:
ave_another_series.get('A')

30.0

In [124]:
pd.Series(5., index=list('ABSDE'))

A    5.0
B    5.0
S    5.0
D    5.0
E    5.0
dtype: float64

In [125]:
ave_simple_series + ave_simple_series

0    0.89
1    0.54
2    0.13
3    1.40
4    0.50
dtype: float64

In [126]:
ave_simple_series

0    0.44
1    0.27
2    0.07
3    0.70
4    0.25
dtype: float64

In [127]:
ave_simple_series + 1000

0    1000.44
1    1000.27
2    1000.07
3    1000.70
4    1000.25
dtype: float64

In [128]:
ave_simple_series

0    0.44
1    0.27
2    0.07
3    0.70
4    0.25
dtype: float64

In [129]:
np.exp(ave_simple_series)

0    1.56
1    1.31
2    1.07
3    2.01
4    1.29
dtype: float64

In [130]:
ave_simple_series[1:]

1    0.27
2    0.07
3    0.70
4    0.25
dtype: float64

In [131]:
ave_simple_series[:-1]

0    0.44
1    0.27
2    0.07
3    0.70
dtype: float64

In [132]:
ave_simple_series[1:] + ave_simple_series[:-1]

0     NaN
1    0.54
2    0.13
3    1.40
4     NaN
dtype: float64

In [133]:
def mult_bt_ten(input_element):
    return input_element * 10.0

In [134]:
ave_simple_series.map(mult_bt_ten)

0    4.45
1    2.72
2    0.67
3    6.98
4    2.51
dtype: float64

In [138]:
series_of_random_stuff = pd.Series(
    ['A', 'B', 'C', 'abracadabra', np.nan, 'DOG', 'cow', 'helicopter'])

In [139]:
series_of_random_stuff.str.lower()

0              a
1              b
2              c
3    abracadabra
4            NaN
5            dog
6            cow
7     helicopter
dtype: object

## date arithmetic

In [140]:
from datetime import datetime

In [141]:
now = datetime.now()
now

datetime.datetime(2021, 10, 17, 15, 15, 54, 433021)

In [142]:
now.year, now.month, now.day

(2021, 10, 17)

In [144]:
delta = now - datetime(2012, 1, 1)
delta

datetime.timedelta(days=3577, seconds=54954, microseconds=433021)

In [146]:
delta.days

3577

In [147]:
pd.Timedelta('5 days 10 hours')

Timedelta('5 days 10:00:00')

In [148]:
pd.Timedelta(days=2, seconds=10)

Timedelta('2 days 00:00:10')

In [152]:
pd.Timedelta(1, unit="d")

Timedelta('1 days 00:00:00')

In [154]:
new_year = datetime(2021, 1, 1)
print(new_year)
national_absurdity_day = datetime(2021, 11, 20)
print(national_absurdity_day)
Tuvalu_independence_day = datetime(2021, 10, 1)
print(Tuvalu_independence_day)

2021-01-01 00:00:00
2021-11-20 00:00:00
2021-10-01 00:00:00

In [158]:
time_to_relax = national_absurdity_day - Tuvalu_independence_day
print(time_to_relax)

50 days, 0:00:00

In [160]:
time_to_relax_range = pd.date_range(national_absurdity_day,
                                    periods=time_to_relax.days,
                                    freq='D')
time_to_relax_range

DatetimeIndex(['2021-11-20', '2021-11-21', '2021-11-22', '2021-11-23',
               '2021-11-24', '2021-11-25', '2021-11-26', '2021-11-27',
               '2021-11-28', '2021-11-29', '2021-11-30', '2021-12-01',
               '2021-12-02', '2021-12-03', '2021-12-04', '2021-12-05',
               '2021-12-06', '2021-12-07', '2021-12-08', '2021-12-09',
               '2021-12-10', '2021-12-11', '2021-12-12', '2021-12-13',
               '2021-12-14', '2021-12-15', '2021-12-16', '2021-12-17',
               '2021-12-18', '2021-12-19', '2021-12-20', '2021-12-21',
               '2021-12-22', '2021-12-23', '2021-12-24', '2021-12-25',
               '2021-12-26', '2021-12-27', '2021-12-28', '2021-12-29',
               '2021-12-30', '2021-12-31', '2022-01-01', '2022-01-02',
               '2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06',
               '2022-01-07', '2022-01-08'],
              dtype='datetime64[ns]', freq='D')

In [162]:
time_to_relax_series = pd.Series(np.random.randn(time_to_relax.days),
                                 index=time_to_relax_range)
time_to_relax_series.tail()

2022-01-04   -1.57
2022-01-05   -0.17
2022-01-06   -0.17
2022-01-07    0.34
2022-01-08    0.25
Freq: D, dtype: float64

In [163]:
ave_dictionary = {'A': 20, 'B': -20, 'C': 666}
print(ave_dictionary.keys())
print(ave_dictionary.values())

dict_keys(['A', 'B', 'C'])
dict_values([20, -20, 666])

In [167]:
ave_dictionary_df = pd.DataFrame(ave_dictionary,
                                 index=['start', 'middle', 'finish'])
ave_dictionary_df

         A   B    C
start   20 -20  666
middle  20 -20  666
finish  20 -20  666

## data frames

In [169]:
book_df = pd.DataFrame({
    'AAA': [4, 5, 6, 7],
    'BBB': [10, 20, 30, 40],
    'CCC': [100, 50, -30, -50]
})
book_df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [170]:
series_dictionary = {
    'one': pd.Series([1., 2., 3.], index=list('abc')),
    'two': pd.Series([1., 2., 3., 4.], index=list('abcd'))
}
series_df= pd.DataFrame(series_dictionary)
series_df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [174]:
fresh_stuff = {'vegetables':['onion', 'courgette', 'aubergine', 'pepper'],
              'fruit':['apple','pear','persimon','plum']}
pd.DataFrame(fresh_stuff)

  vegetables     fruit
0      onion     apple
1  courgette      pear
2  aubergine  persimon
3     pepper      plum

In [173]:
some_data = [{'a':1,'b':2},{'a':5,'b':10, 'c':20}]
pd.DataFrame(some_data)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [177]:
pd.DataFrame(np.arange(24).reshape(4,6), index=list('aabc'), columns=list('ABCDEF'))

    A   B   C   D   E   F
a   0   1   2   3   4   5
a   6   7   8   9  10  11
b  12  13  14  15  16  17
c  18  19  20  21  22  23

## crosstab

In [2]:
headers = ["symboling", "normalized_losses", "make", "fuel_type", "aspiration",
           "num_doors", "body_style", "drive_wheels", "engine_location",
           "wheel_base", "length", "width", "height", "curb_weight",
           "engine_type", "num_cylinders", "engine_size", "fuel_system",
           "bore", "stroke", "compression_ratio", "horsepower", "peak_rpm",
           "city_mpg", "highway_mpg", "price"]
df_raw = pd.read_csv("https://github.com/dm-fedorov/pandas_basic/blob/master/%D0%B1%D1%8B%D1%81%D1%82%D1%80%D0%BE%D0%B5%20%D0%B2%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%B2%20pandas/data/imports-85.data?raw=true",
                     header=None,
                     names=headers,
                     na_values="?")
df_raw.head()

,symboling,normalized_losses,make,fuel_type,aspiration,num_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111.0,5000.0,21,27,13495.0
1,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111.0,5000.0,21,27,16500.0
2,1,NaN,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154.0,5000.0,19,26,16500.0
3,2,164.0,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.40,10.0,102.0,5500.0,24,30,13950.0
4,2,164.0,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.40,8.0,115.0,5500.0,18,22,17450.0

In [3]:
df_raw.describe()

,symboling,normalized_losses,wheel_base,length,width,height,curb_weight,engine_size,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
count,205.000000,164.000000,205.000000,205.000000,205.000000,205.000000,205.000000,205.000000,201.000000,201.000000,205.000000,203.000000,203.000000,205.000000,205.000000,201.000000
mean,0.834146,122.000000,98.756585,174.049268,65.907805,53.724878,2555.565854,126.907317,3.329751,3.255423,10.142537,104.256158,5125.369458,25.219512,30.751220,13207.129353
std,1.245307,35.442168,6.021776,12.337289,2.145204,2.443522,520.680204,41.642693,0.273539,0.316717,3.972040,39.714369,479.334560,6.542142,6.886443,7947.066342
min,-2.000000,65.000000,86.600000,141.100000,60.300000,47.800000,1488.000000,61.000000,2.540000,2.070000,7.000000,48.000000,4150.000000,13.000000,16.000000,5118.000000
25%,0.000000,94.000000,94.500000,166.300000,64.100000,52.000000,2145.000000,97.000000,3.150000,3.110000,8.600000,70.000000,4800.000000,19.000000,25.000000,7775.000000
50%,1.000000,115.000000,97.000000,173.200000,65.500000,54.100000,2414.000000,120.000000,3.310000,3.290000,9.000000,95.000000,5200.000000,24.000000,30.000000,10295.000000
75%,2.000000,150.000000,102.400000,183.100000,66.900000,55.500000,2935.000000,141.000000,3.590000,3.410000,9.400000,116.000000,5500.000000,30.000000,34.000000,16500.000000
max,3.000000,256.000000,120.900000,208.100000,72.300000,59.800000,4066.000000,326.000000,3.940000,4.170000,23.000000,288.000000,6600.000000,49.000000,54.000000,45400.000000